Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ2025DAK176.PIC
      <edc:DCRDef edc:_addr="0x1FC6FF68" edc:access="--------------------------------" edc:cname="ABF2DEVSIGN1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2DEVSIGN1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF6C" edc:access="--------------------------------" edc:cname="ABF2DEVSIGN0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x0" edc:name="ABF2DEVSIGN0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="31"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF70" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ABF2SEQ3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffffffff" edc:name="ABF2SEQ3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="TSEQ" edc:desc="Boot Flash True Sequence Number" edc:mask="0xffff" edc:name="TSEQ" edc:nzwidth="16"/>
            <edc:DCRFieldDef edc:cname="CSEQ" edc:desc="Boot Flash Complement Sequence Number" edc:mask="0xffff" edc:name="CSEQ" edc:nzwidth="16"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF74" edc:access="--------------------------------" edc:cname="ABF2SEQ2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2SEQ2" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF78" edc:access="--------------------------------" edc:cname="ABF2SEQ1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2SEQ1" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC6FF7C" edc:access="--------------------------------" edc:cname="ABF2SEQ0" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x0" edc:name="ABF2SEQ0" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0"/>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:AltConfigFuseSector>
    <edc:AltConfigFuseSector edc:beginaddr="0x1fc6ffb0" edc:endaddr="0x1fc70000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="boot2config" edc:regionidref="lowerbootaliasconfig" edc:registerprefix="BF2">
      <edc:AdjustPoint edc:_addr="0x1FC6FFB0" edc:offset="0xc"/>
      <edc:DCRDef edc:_addr="0x1FC6FFBC" edc:access="---nnnnn------------------------" edc:cname="BF2DEVCFG4" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x1f000000" edc:name="BF2DEVCFG4" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:DCRFieldDef edc:cname="SWDTPS" edc:desc="Sleep Mode Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="SPS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="SPS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SPS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SPS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SPS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="SPS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SPS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="SPS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SPS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="SPS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="SPS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="SPS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="SPS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="SPS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="SPS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="SPS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="SPS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="SPS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="SPS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="SPS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="SPS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
